K= 5
N_WAY= 12
Model: "generator"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense (Dense)                (None, 6272)              809088    
_________________________________________________________________
leaky_re_lu (LeakyReLU)      (None, 6272)              0         
_________________________________________________________________
reshape (Reshape)            (None, 7, 7, 128)         0         
_________________________________________________________________
conv2d_transpose (Conv2DTran (None, 14, 14, 128)       262272    
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 14, 14, 128)       0         
_________________________________________________________________
conv2d_transpose_1 (Conv2DTr (None, 28, 28, 128)       262272    
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 28, 28, 128)       0         
_________________________________________________________________
conv2d (Conv2D)              (None, 28, 28, 1)         6273      
=================================================================
Total params: 1,339,905
Trainable params: 1,339,905
Non-trainable params: 0
_________________________________________________________________
Model: "discriminator"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 14, 14, 64)        640       
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 14, 14, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 7, 7, 128)         73856     
_________________________________________________________________
leaky_re_lu_4 (LeakyReLU)    (None, 7, 7, 128)         0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 4, 4, 128)         147584    
_________________________________________________________________
leaky_re_lu_5 (LeakyReLU)    (None, 4, 4, 128)         0         
_________________________________________________________________
global_max_pooling2d (Global (None, 128)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 129       
=================================================================
Total params: 222,209
Trainable params: 222,209
Non-trainable params: 0
_________________________________________________________________
Continue training from epoch 500.
GAN training finished
before: 1200
after: 36
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  780       
=================================================================
Total params: 112,972
Trainable params: 112,460
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  780       
=================================================================
Total params: 112,972
Trainable params: 112,460
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  780       
=================================================================
Total params: 112,972
Trainable params: 112,460
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  780       
=================================================================
Total params: 112,972
Trainable params: 112,460
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  780       
=================================================================
Total params: 112,972
Trainable params: 112,460
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  780       
=================================================================
Total params: 112,972
Trainable params: 112,460
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  780       
=================================================================
Total params: 112,972
Trainable params: 112,460
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  780       
=================================================================
Total params: 112,972
Trainable params: 112,460
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  780       
=================================================================
Total params: 112,972
Trainable params: 112,460
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  780       
=================================================================
Total params: 112,972
Trainable params: 112,460
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  780       
=================================================================
Total params: 112,972
Trainable params: 112,460
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  780       
=================================================================
Total params: 112,972
Trainable params: 112,460
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  780       
=================================================================
Total params: 112,972
Trainable params: 112,460
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  780       
=================================================================
Total params: 112,972
Trainable params: 112,460
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  780       
=================================================================
Total params: 112,972
Trainable params: 112,460
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  780       
=================================================================
Total params: 112,972
Trainable params: 112,460
Non-trainable params: 512
_________________________________________________________________
Not Loading any SLMAMLGAN model
 #### ### ## # N_labeled: 20
 #### ### ## # N_gen 0
Percentage of labeled data: 0.03
Validation Loss: 2.036241054534912
Validation Accuracy: 0.36633339524269104
Validation Loss: 1.8677701950073242
Validation Accuracy: 0.6336666345596313
Train Loss: 0.34000420570373535
Train Accuracy: 0.9422257542610168
==================
Resuming Training
=======1000=======
==================
0 / 100 are evaluated.
5 / 100 are evaluated.
10 / 100 are evaluated.
15 / 100 are evaluated.
20 / 100 are evaluated.
25 / 100 are evaluated.
30 / 100 are evaluated.
35 / 100 are evaluated.
40 / 100 are evaluated.
45 / 100 are evaluated.
50 / 100 are evaluated.
55 / 100 are evaluated.
60 / 100 are evaluated.
65 / 100 are evaluated.
70 / 100 are evaluated.
75 / 100 are evaluated.
80 / 100 are evaluated.
85 / 100 are evaluated.
90 / 100 are evaluated.
95 / 100 are evaluated.
loss mean: 0.4040399193763733
loss std: 0.1329401135444641
accuracy mean: 0.8786666393280029
accuracy std: 0.049164120107889175
final acc: 0.8786666393280029 +- 0.009636167541146278
final acc: 87.87 +- 0.96
