Model: "generator"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense (Dense)                (None, 6272)              809088    
_________________________________________________________________
leaky_re_lu (LeakyReLU)      (None, 6272)              0         
_________________________________________________________________
reshape (Reshape)            (None, 7, 7, 128)         0         
_________________________________________________________________
conv2d_transpose (Conv2DTran (None, 14, 14, 128)       262272    
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 14, 14, 128)       0         
_________________________________________________________________
conv2d_transpose_1 (Conv2DTr (None, 28, 28, 128)       262272    
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 28, 28, 128)       0         
_________________________________________________________________
conv2d (Conv2D)              (None, 28, 28, 1)         6273      
=================================================================
Total params: 1,339,905
Trainable params: 1,339,905
Non-trainable params: 0
_________________________________________________________________
Model: "discriminator"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 14, 14, 64)        640       
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 14, 14, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 7, 7, 128)         73856     
_________________________________________________________________
leaky_re_lu_4 (LeakyReLU)    (None, 7, 7, 128)         0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 4, 4, 128)         147584    
_________________________________________________________________
leaky_re_lu_5 (LeakyReLU)    (None, 4, 4, 128)         0         
_________________________________________________________________
global_max_pooling2d (Global (None, 128)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 129       
=================================================================
Total params: 222,209
Trainable params: 222,209
Non-trainable params: 0
_________________________________________________________________
Continue training from epoch 500.
GAN training finished
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  325       
=================================================================
Total params: 112,517
Trainable params: 112,005
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  325       
=================================================================
Total params: 112,517
Trainable params: 112,005
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  325       
=================================================================
Total params: 112,517
Trainable params: 112,005
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  325       
=================================================================
Total params: 112,517
Trainable params: 112,005
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  325       
=================================================================
Total params: 112,517
Trainable params: 112,005
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  325       
=================================================================
Total params: 112,517
Trainable params: 112,005
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  325       
=================================================================
Total params: 112,517
Trainable params: 112,005
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  325       
=================================================================
Total params: 112,517
Trainable params: 112,005
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  325       
=================================================================
Total params: 112,517
Trainable params: 112,005
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  325       
=================================================================
Total params: 112,517
Trainable params: 112,005
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  325       
=================================================================
Total params: 112,517
Trainable params: 112,005
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  325       
=================================================================
Total params: 112,517
Trainable params: 112,005
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  325       
=================================================================
Total params: 112,517
Trainable params: 112,005
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  325       
=================================================================
Total params: 112,517
Trainable params: 112,005
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  325       
=================================================================
Total params: 112,517
Trainable params: 112,005
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  325       
=================================================================
Total params: 112,517
Trainable params: 112,005
Non-trainable params: 512
_________________________________________________________________
 #### ### ## # N_labeled: 6
 #### ### ## # N_gen 14
Percentage of labeled data: 0.3
Validation Loss: 1.202174425125122
Validation Accuracy: 0.5359999537467957
Train Loss: 0.4470425546169281
Train Accuracy: 0.8697496652603149
Validation Loss: 1.1330657005310059
Validation Accuracy: 0.5499998331069946
Train Loss: 0.40125054121017456
Train Accuracy: 0.8789998888969421
Validation Loss: 1.1147260665893555
Validation Accuracy: 0.5659999251365662
Train Loss: 0.3630169928073883
Train Accuracy: 0.8909996747970581
Validation Loss: 1.1115690469741821
Validation Accuracy: 0.5639998912811279
Train Loss: 0.3356482982635498
Train Accuracy: 0.8962497711181641
Validation Loss: 1.0736684799194336
Validation Accuracy: 0.5779998898506165
Train Loss: 0.31624191999435425
Train Accuracy: 0.901999831199646
Validation Loss: 1.0804094076156616
Validation Accuracy: 0.5759998559951782
Train Loss: 0.29576659202575684
Train Accuracy: 0.9069995880126953
Validation Loss: 1.0346193313598633
Validation Accuracy: 0.5899999141693115
Train Loss: 0.28331631422042847
Train Accuracy: 0.9102499485015869
Validation Loss: 1.0155755281448364
Validation Accuracy: 0.5879999399185181
Train Loss: 0.2576424479484558
Train Accuracy: 0.9222497344017029
Validation Loss: 0.9628360271453857
Validation Accuracy: 0.6279998421669006
Train Loss: 0.22231020033359528
Train Accuracy: 0.9334995746612549
Validation Loss: 0.9245679974555969
Validation Accuracy: 0.669999897480011
Train Loss: 0.2265445739030838
Train Accuracy: 0.9297497272491455
Validation Loss: 0.9097071290016174
Validation Accuracy: 0.6419997215270996
Train Loss: 0.2245856076478958
Train Accuracy: 0.9279994368553162
Validation Loss: 0.8750892877578735
Validation Accuracy: 0.6659997701644897
Train Loss: 0.20548595488071442
Train Accuracy: 0.9359998106956482
Validation Loss: 0.9334591031074524
Validation Accuracy: 0.6359997391700745
Train Loss: 0.1861497461795807
Train Accuracy: 0.9409998059272766
Validation Loss: 0.9421373605728149
Validation Accuracy: 0.6579998731613159
Train Loss: 0.1909961700439453
Train Accuracy: 0.9414995312690735
Validation Loss: 0.9105914235115051
Validation Accuracy: 0.6539996862411499
Train Loss: 0.18526677787303925
Train Accuracy: 0.9414997696876526
Validation Loss: 0.8775458335876465
Validation Accuracy: 0.6719997525215149
Train Loss: 0.18234914541244507
Train Accuracy: 0.9409995079040527
Validation Loss: 0.8985118865966797
Validation Accuracy: 0.659999668598175
Train Loss: 0.1552964150905609
Train Accuracy: 0.9507497549057007
Validation Loss: 0.907993495464325
Validation Accuracy: 0.667999804019928
Train Loss: 0.17329059541225433
Train Accuracy: 0.9434993863105774
Validation Loss: 0.9410378932952881
Validation Accuracy: 0.6599997878074646
Train Loss: 0.15673193335533142
Train Accuracy: 0.949249804019928
Validation Loss: 0.8905743956565857
Validation Accuracy: 0.6859998106956482
Train Loss: 0.18110798299312592
Train Accuracy: 0.9402493834495544
Validation Loss: 0.8733584880828857
Validation Accuracy: 0.6719998121261597
Train Loss: 0.1686040759086609
Train Accuracy: 0.94549959897995
Validation Loss: 0.8764688968658447
Validation Accuracy: 0.6619997620582581
Train Loss: 0.14370040595531464
Train Accuracy: 0.9529997110366821
Validation Loss: 0.8958598375320435
Validation Accuracy: 0.6759997606277466
Train Loss: 0.13997825980186462
Train Accuracy: 0.9559994339942932
Validation Loss: 0.9241995811462402
Validation Accuracy: 0.6639997959136963
Train Loss: 0.13348692655563354
Train Accuracy: 0.9589994549751282
Validation Loss: 0.9044033885002136
Validation Accuracy: 0.6759997010231018
Train Loss: 0.1379697024822235
Train Accuracy: 0.9574996829032898
==================
Resuming Training
=======5000=======
==================
0 / 1000 are evaluated.
50 / 1000 are evaluated.
100 / 1000 are evaluated.
150 / 1000 are evaluated.
200 / 1000 are evaluated.
250 / 1000 are evaluated.
300 / 1000 are evaluated.
350 / 1000 are evaluated.
400 / 1000 are evaluated.
450 / 1000 are evaluated.
500 / 1000 are evaluated.
550 / 1000 are evaluated.
600 / 1000 are evaluated.
650 / 1000 are evaluated.
700 / 1000 are evaluated.
750 / 1000 are evaluated.
800 / 1000 are evaluated.
850 / 1000 are evaluated.
900 / 1000 are evaluated.
950 / 1000 are evaluated.
loss mean: 0.5245794653892517
loss std: 0.49808743596076965
accuracy mean: 0.8184000253677368
accuracy std: 0.19073916971683502
final acc: 0.8184000253677368 +- 0.011822136220166405
final acc: 81.84 +- 1.18
