Model: "generator"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense (Dense)                (None, 6272)              809088    
_________________________________________________________________
leaky_re_lu (LeakyReLU)      (None, 6272)              0         
_________________________________________________________________
reshape (Reshape)            (None, 7, 7, 128)         0         
_________________________________________________________________
conv2d_transpose (Conv2DTran (None, 14, 14, 128)       262272    
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 14, 14, 128)       0         
_________________________________________________________________
conv2d_transpose_1 (Conv2DTr (None, 28, 28, 128)       262272    
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 28, 28, 128)       0         
_________________________________________________________________
conv2d (Conv2D)              (None, 28, 28, 1)         6273      
=================================================================
Total params: 1,339,905
Trainable params: 1,339,905
Non-trainable params: 0
_________________________________________________________________
Model: "discriminator"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 14, 14, 64)        640       
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 14, 14, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 7, 7, 128)         73856     
_________________________________________________________________
leaky_re_lu_4 (LeakyReLU)    (None, 7, 7, 128)         0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 4, 4, 128)         147584    
_________________________________________________________________
leaky_re_lu_5 (LeakyReLU)    (None, 4, 4, 128)         0         
_________________________________________________________________
global_max_pooling2d (Global (None, 128)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 129       
=================================================================
Total params: 222,209
Trainable params: 222,209
Non-trainable params: 0
_________________________________________________________________
Continue training from epoch 500.
GAN training finished
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  325       
=================================================================
Total params: 112,517
Trainable params: 112,005
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  325       
=================================================================
Total params: 112,517
Trainable params: 112,005
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  325       
=================================================================
Total params: 112,517
Trainable params: 112,005
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  325       
=================================================================
Total params: 112,517
Trainable params: 112,005
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  325       
=================================================================
Total params: 112,517
Trainable params: 112,005
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  325       
=================================================================
Total params: 112,517
Trainable params: 112,005
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  325       
=================================================================
Total params: 112,517
Trainable params: 112,005
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  325       
=================================================================
Total params: 112,517
Trainable params: 112,005
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  325       
=================================================================
Total params: 112,517
Trainable params: 112,005
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  325       
=================================================================
Total params: 112,517
Trainable params: 112,005
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  325       
=================================================================
Total params: 112,517
Trainable params: 112,005
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  325       
=================================================================
Total params: 112,517
Trainable params: 112,005
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  325       
=================================================================
Total params: 112,517
Trainable params: 112,005
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  325       
=================================================================
Total params: 112,517
Trainable params: 112,005
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  325       
=================================================================
Total params: 112,517
Trainable params: 112,005
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  325       
=================================================================
Total params: 112,517
Trainable params: 112,005
Non-trainable params: 512
_________________________________________________________________
 #### ### ## # N_labeled: 2
 #### ### ## # N_gen 18
Percentage of labeled data: 0.1
Validation Loss: 1.3141590356826782
Validation Accuracy: 0.48600009083747864
Train Loss: 0.2603820562362671
Train Accuracy: 0.9372496604919434
Validation Loss: 1.3497172594070435
Validation Accuracy: 0.4219999611377716
Train Loss: 0.23792532086372375
Train Accuracy: 0.9394996166229248
Validation Loss: 1.3105969429016113
Validation Accuracy: 0.47600001096725464
Train Loss: 0.2255842089653015
Train Accuracy: 0.9389994740486145
Validation Loss: 1.2731308937072754
Validation Accuracy: 0.49799996614456177
Train Loss: 0.20708657801151276
Train Accuracy: 0.945249617099762
Validation Loss: 1.2416362762451172
Validation Accuracy: 0.49000000953674316
Train Loss: 0.20963135361671448
Train Accuracy: 0.9412496089935303
Validation Loss: 1.2555794715881348
Validation Accuracy: 0.5159998536109924
Train Loss: 0.18951913714408875
Train Accuracy: 0.9462495446205139
Validation Loss: 1.3090171813964844
Validation Accuracy: 0.47800007462501526
Train Loss: 0.15958867967128754
Train Accuracy: 0.9589996337890625
Validation Loss: 1.3043338060379028
Validation Accuracy: 0.49800002574920654
Train Loss: 0.1760392040014267
Train Accuracy: 0.9497494697570801
Validation Loss: 1.2858070135116577
Validation Accuracy: 0.4859999418258667
Train Loss: 0.16645300388336182
Train Accuracy: 0.9517496228218079
Validation Loss: 1.2675745487213135
Validation Accuracy: 0.49799999594688416
Train Loss: 0.16507136821746826
Train Accuracy: 0.9494996666908264
Validation Loss: 1.2629852294921875
Validation Accuracy: 0.5039999485015869
Train Loss: 0.16026151180267334
Train Accuracy: 0.951999843120575
Validation Loss: 1.2755964994430542
Validation Accuracy: 0.49400004744529724
Train Loss: 0.16952849924564362
Train Accuracy: 0.9489997029304504
Validation Loss: 1.2764592170715332
Validation Accuracy: 0.4880000352859497
Train Loss: 0.16451312601566315
Train Accuracy: 0.9474996328353882
Validation Loss: 1.3170608282089233
Validation Accuracy: 0.492000013589859
Train Loss: 0.1837923228740692
Train Accuracy: 0.943249523639679
Validation Loss: 1.2611948251724243
Validation Accuracy: 0.49400001764297485
Train Loss: 0.14980600774288177
Train Accuracy: 0.9504997134208679
Validation Loss: 1.2660572528839111
Validation Accuracy: 0.5199999213218689
Train Loss: 0.14046813547611237
Train Accuracy: 0.9554997086524963
Validation Loss: 1.2376117706298828
Validation Accuracy: 0.5320000648498535
Train Loss: 0.11671712249517441
Train Accuracy: 0.9612497687339783
Validation Loss: 1.3749159574508667
Validation Accuracy: 0.4859999716281891
Train Loss: 0.13917304575443268
Train Accuracy: 0.9564995765686035
Validation Loss: 1.3265252113342285
Validation Accuracy: 0.4919998049736023
Train Loss: 0.1938214898109436
Train Accuracy: 0.9387496113777161
Validation Loss: 1.286410927772522
Validation Accuracy: 0.5039999485015869
Train Loss: 0.18228405714035034
Train Accuracy: 0.9417495131492615
Validation Loss: 1.301002860069275
Validation Accuracy: 0.49599990248680115
Train Loss: 0.15338528156280518
Train Accuracy: 0.9504997134208679
Validation Loss: 1.288259744644165
Validation Accuracy: 0.5039997696876526
Train Loss: 0.14904659986495972
Train Accuracy: 0.951499879360199
Validation Loss: 1.265365719795227
Validation Accuracy: 0.5040000081062317
Train Loss: 0.14263246953487396
Train Accuracy: 0.9519996643066406
Validation Loss: 1.3027905225753784
Validation Accuracy: 0.4959999918937683
Train Loss: 0.15609300136566162
Train Accuracy: 0.9497495889663696
Validation Loss: 1.259352445602417
Validation Accuracy: 0.5039999485015869
Train Loss: 0.1529359668493271
Train Accuracy: 0.9494994878768921
==================
Resuming Training
=======5000=======
==================
0 / 1000 are evaluated.
50 / 1000 are evaluated.
100 / 1000 are evaluated.
150 / 1000 are evaluated.
200 / 1000 are evaluated.
250 / 1000 are evaluated.
300 / 1000 are evaluated.
350 / 1000 are evaluated.
400 / 1000 are evaluated.
450 / 1000 are evaluated.
500 / 1000 are evaluated.
550 / 1000 are evaluated.
600 / 1000 are evaluated.
650 / 1000 are evaluated.
700 / 1000 are evaluated.
750 / 1000 are evaluated.
800 / 1000 are evaluated.
850 / 1000 are evaluated.
900 / 1000 are evaluated.
950 / 1000 are evaluated.
loss mean: 0.9236491918563843
loss std: 0.6675462126731873
accuracy mean: 0.6748000383377075
accuracy std: 0.23934274911880493
final acc: 0.6748000383377075 +- 0.014834617281768965
final acc: 67.48 +- 1.48
