Model: "generator"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense (Dense)                (None, 6272)              809088    
_________________________________________________________________
leaky_re_lu (LeakyReLU)      (None, 6272)              0         
_________________________________________________________________
reshape (Reshape)            (None, 7, 7, 128)         0         
_________________________________________________________________
conv2d_transpose (Conv2DTran (None, 14, 14, 128)       262272    
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 14, 14, 128)       0         
_________________________________________________________________
conv2d_transpose_1 (Conv2DTr (None, 28, 28, 128)       262272    
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 28, 28, 128)       0         
_________________________________________________________________
conv2d (Conv2D)              (None, 28, 28, 1)         6273      
=================================================================
Total params: 1,339,905
Trainable params: 1,339,905
Non-trainable params: 0
_________________________________________________________________
Model: "discriminator"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 14, 14, 64)        640       
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 14, 14, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 7, 7, 128)         73856     
_________________________________________________________________
leaky_re_lu_4 (LeakyReLU)    (None, 7, 7, 128)         0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 4, 4, 128)         147584    
_________________________________________________________________
leaky_re_lu_5 (LeakyReLU)    (None, 4, 4, 128)         0         
_________________________________________________________________
global_max_pooling2d (Global (None, 128)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 129       
=================================================================
Total params: 222,209
Trainable params: 222,209
Non-trainable params: 0
_________________________________________________________________
Continue training from epoch 500.
GAN training finished
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  650       
=================================================================
Total params: 112,842
Trainable params: 112,330
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  650       
=================================================================
Total params: 112,842
Trainable params: 112,330
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  650       
=================================================================
Total params: 112,842
Trainable params: 112,330
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  650       
=================================================================
Total params: 112,842
Trainable params: 112,330
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  650       
=================================================================
Total params: 112,842
Trainable params: 112,330
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  650       
=================================================================
Total params: 112,842
Trainable params: 112,330
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  650       
=================================================================
Total params: 112,842
Trainable params: 112,330
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  650       
=================================================================
Total params: 112,842
Trainable params: 112,330
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  650       
=================================================================
Total params: 112,842
Trainable params: 112,330
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  650       
=================================================================
Total params: 112,842
Trainable params: 112,330
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  650       
=================================================================
Total params: 112,842
Trainable params: 112,330
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  650       
=================================================================
Total params: 112,842
Trainable params: 112,330
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  650       
=================================================================
Total params: 112,842
Trainable params: 112,330
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  650       
=================================================================
Total params: 112,842
Trainable params: 112,330
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  650       
=================================================================
Total params: 112,842
Trainable params: 112,330
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  650       
=================================================================
Total params: 112,842
Trainable params: 112,330
Non-trainable params: 512
_________________________________________________________________
Warning: Not loading any MAML model
 #### ### ## # N_labeled: 20
 #### ### ## # N_gen 0
Percentage of labeled data: 0.1
Validation Loss: 1.5777157545089722
Validation Accuracy: 0.5019999742507935
Train Loss: 1.499343991279602
Train Accuracy: 0.5333750247955322
Validation Loss: 1.3503479957580566
Validation Accuracy: 0.6010000109672546
Train Loss: 1.1683441400527954
Train Accuracy: 0.659375011920929
Validation Loss: 1.1541749238967896
Validation Accuracy: 0.6559999585151672
Train Loss: 0.8558865189552307
Train Accuracy: 0.7707498073577881
Validation Loss: 1.096411943435669
Validation Accuracy: 0.6679998636245728
Train Loss: 0.6545206308364868
Train Accuracy: 0.833250105381012
Validation Loss: 1.046612024307251
Validation Accuracy: 0.6759998798370361
Train Loss: 0.5114971399307251
Train Accuracy: 0.8804997205734253
Validation Loss: 1.0187292098999023
Validation Accuracy: 0.6769998669624329
Train Loss: 0.3835323452949524
Train Accuracy: 0.9141252636909485
Validation Loss: 1.0199313163757324
Validation Accuracy: 0.6659998893737793
Train Loss: 0.27673542499542236
Train Accuracy: 0.940875232219696
Validation Loss: 1.0778487920761108
Validation Accuracy: 0.640999972820282
Train Loss: 0.2040388286113739
Train Accuracy: 0.9577503204345703
Validation Loss: 1.0582044124603271
Validation Accuracy: 0.6430001258850098
Train Loss: 0.13973765075206757
Train Accuracy: 0.9725000858306885
Validation Loss: 1.1182255744934082
Validation Accuracy: 0.6399999856948853
Train Loss: 0.10959672927856445
Train Accuracy: 0.9781250953674316
Validation Loss: 1.1023613214492798
Validation Accuracy: 0.638999879360199
Train Loss: 0.08817734569311142
Train Accuracy: 0.9826249480247498
Validation Loss: 1.149061918258667
Validation Accuracy: 0.6210000514984131
Train Loss: 0.07583709061145782
Train Accuracy: 0.9850004315376282
Validation Loss: 1.1739490032196045
Validation Accuracy: 0.6260000467300415
Train Loss: 0.08033415675163269
Train Accuracy: 0.9831251502037048
Validation Loss: 1.1997524499893188
Validation Accuracy: 0.6110000014305115
Train Loss: 0.05830781161785126
Train Accuracy: 0.9888755083084106
Validation Loss: 1.1833239793777466
Validation Accuracy: 0.6169999837875366
Train Loss: 0.045194126665592194
Train Accuracy: 0.99262535572052
Validation Loss: 1.2293645143508911
Validation Accuracy: 0.597000002861023
Train Loss: 0.04806777462363243
Train Accuracy: 0.9903752207756042
Validation Loss: 1.2084109783172607
Validation Accuracy: 0.5950000286102295
Train Loss: 0.04580964520573616
Train Accuracy: 0.9917503595352173
Validation Loss: 1.271691918373108
Validation Accuracy: 0.5709999799728394
Train Loss: 0.04470159485936165
Train Accuracy: 0.9902501106262207
Validation Loss: 1.2434028387069702
Validation Accuracy: 0.5889999866485596
Train Loss: 0.03927692025899887
Train Accuracy: 0.9927502274513245
Validation Loss: 1.2523621320724487
Validation Accuracy: 0.6059998869895935
Train Loss: 0.03780695050954819
Train Accuracy: 0.9926254749298096
Validation Loss: 1.2257405519485474
Validation Accuracy: 0.5979999899864197
Train Loss: 0.040475279092788696
Train Accuracy: 0.9925001263618469
Validation Loss: 1.268966555595398
Validation Accuracy: 0.5929998755455017
Train Loss: 0.036367472261190414
Train Accuracy: 0.9921251535415649
Validation Loss: 1.3002691268920898
Validation Accuracy: 0.5889999866485596
Train Loss: 0.04025685414671898
Train Accuracy: 0.9920005202293396
Validation Loss: 1.2831448316574097
Validation Accuracy: 0.5799998641014099
Train Loss: 0.03042484261095524
Train Accuracy: 0.9937503933906555
Validation Loss: 1.2871828079223633
Validation Accuracy: 0.5969998836517334
Train Loss: 0.0372731052339077
Train Accuracy: 0.991875410079956
==================
Resuming Training
=======5000=======
==================
0 / 1000 are evaluated.
50 / 1000 are evaluated.
100 / 1000 are evaluated.
150 / 1000 are evaluated.
200 / 1000 are evaluated.
250 / 1000 are evaluated.
300 / 1000 are evaluated.
350 / 1000 are evaluated.
400 / 1000 are evaluated.
450 / 1000 are evaluated.
500 / 1000 are evaluated.
550 / 1000 are evaluated.
600 / 1000 are evaluated.
650 / 1000 are evaluated.
700 / 1000 are evaluated.
750 / 1000 are evaluated.
800 / 1000 are evaluated.
850 / 1000 are evaluated.
900 / 1000 are evaluated.
950 / 1000 are evaluated.
loss mean: 0.9611905813217163
loss std: 0.5027158260345459
accuracy mean: 0.699999988079071
accuracy std: 0.1545962393283844
final acc: 0.699999988079071 +- 0.009581974185894206
final acc: 70.00 +- 0.96
