Model: "generator"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense (Dense)                (None, 6272)              809088    
_________________________________________________________________
leaky_re_lu (LeakyReLU)      (None, 6272)              0         
_________________________________________________________________
reshape (Reshape)            (None, 7, 7, 128)         0         
_________________________________________________________________
conv2d_transpose (Conv2DTran (None, 14, 14, 128)       262272    
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 14, 14, 128)       0         
_________________________________________________________________
conv2d_transpose_1 (Conv2DTr (None, 28, 28, 128)       262272    
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 28, 28, 128)       0         
_________________________________________________________________
conv2d (Conv2D)              (None, 28, 28, 1)         6273      
=================================================================
Total params: 1,339,905
Trainable params: 1,339,905
Non-trainable params: 0
_________________________________________________________________
Model: "discriminator"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 14, 14, 64)        640       
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 14, 14, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 7, 7, 128)         73856     
_________________________________________________________________
leaky_re_lu_4 (LeakyReLU)    (None, 7, 7, 128)         0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 4, 4, 128)         147584    
_________________________________________________________________
leaky_re_lu_5 (LeakyReLU)    (None, 4, 4, 128)         0         
_________________________________________________________________
global_max_pooling2d (Global (None, 128)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 129       
=================================================================
Total params: 222,209
Trainable params: 222,209
Non-trainable params: 0
_________________________________________________________________
Continue training from epoch 500.
STUPID PATH: /home/helgi/programming/meta-learning-framework/models/lasiummamlgan/gan/omniglot/gan_checkpoints/gan_{epoch:02d}
GAN training finished
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  325       
=================================================================
Total params: 112,517
Trainable params: 112,005
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  325       
=================================================================
Total params: 112,517
Trainable params: 112,005
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  325       
=================================================================
Total params: 112,517
Trainable params: 112,005
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  325       
=================================================================
Total params: 112,517
Trainable params: 112,005
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  325       
=================================================================
Total params: 112,517
Trainable params: 112,005
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  325       
=================================================================
Total params: 112,517
Trainable params: 112,005
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  325       
=================================================================
Total params: 112,517
Trainable params: 112,005
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  325       
=================================================================
Total params: 112,517
Trainable params: 112,005
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  325       
=================================================================
Total params: 112,517
Trainable params: 112,005
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  325       
=================================================================
Total params: 112,517
Trainable params: 112,005
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  325       
=================================================================
Total params: 112,517
Trainable params: 112,005
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  325       
=================================================================
Total params: 112,517
Trainable params: 112,005
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  325       
=================================================================
Total params: 112,517
Trainable params: 112,005
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  325       
=================================================================
Total params: 112,517
Trainable params: 112,005
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  325       
=================================================================
Total params: 112,517
Trainable params: 112,005
Non-trainable params: 512
_________________________________________________________________
Model: "SimpleModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               multiple                  640       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv2 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv3 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  192       
_________________________________________________________________
conv4 (Conv2D)               multiple                  36928     
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  192       
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  325       
=================================================================
Total params: 112,517
Trainable params: 112,005
Non-trainable params: 512
_________________________________________________________________
No previous checkpoint found!
 #### ### ## # N_labeled: 1
 #### ### ## # N_gen 19
Percentage of labeled data: 0.05
Validation Loss: 1.324150562286377
Validation Accuracy: 0.4340001046657562
Train Loss: 0.21453620493412018
Train Accuracy: 0.9627496600151062
Validation Loss: 1.336031436920166
Validation Accuracy: 0.46000006794929504
Train Loss: 0.190632626414299
Train Accuracy: 0.9592493176460266
Validation Loss: 1.3218088150024414
Validation Accuracy: 0.4819999933242798
Train Loss: 0.18034857511520386
Train Accuracy: 0.961249589920044
Validation Loss: 1.3111377954483032
Validation Accuracy: 0.46199989318847656
Train Loss: 0.15112772583961487
Train Accuracy: 0.9647499918937683
Validation Loss: 1.2865846157073975
Validation Accuracy: 0.5080001354217529
Train Loss: 0.13419459760189056
Train Accuracy: 0.9659996628761292
Validation Loss: 1.280951976776123
Validation Accuracy: 0.5039999485015869
Train Loss: 0.1178133562207222
Train Accuracy: 0.9682496786117554
Validation Loss: 1.2861288785934448
Validation Accuracy: 0.5080000162124634
Train Loss: 0.11201702058315277
Train Accuracy: 0.9657496809959412
Validation Loss: 1.320295810699463
Validation Accuracy: 0.4880000352859497
Train Loss: 0.11069495975971222
Train Accuracy: 0.9682497382164001
Validation Loss: 1.302474856376648
Validation Accuracy: 0.5039999485015869
Train Loss: 0.11048752069473267
Train Accuracy: 0.9674996733665466
Validation Loss: 1.3763715028762817
Validation Accuracy: 0.49000000953674316
Train Loss: 0.10521991550922394
Train Accuracy: 0.9672496914863586
Validation Loss: 1.3074651956558228
Validation Accuracy: 0.49599990248680115
Train Loss: 0.1095704734325409
Train Accuracy: 0.9669996500015259
Validation Loss: 1.3621454238891602
Validation Accuracy: 0.48200008273124695
Train Loss: 0.10595128685235977
Train Accuracy: 0.9697495102882385
Validation Loss: 1.3408668041229248
Validation Accuracy: 0.4760000705718994
Train Loss: 0.11281289160251617
Train Accuracy: 0.9664996862411499
Validation Loss: 1.3558465242385864
Validation Accuracy: 0.49800005555152893
Train Loss: 0.10927238315343857
Train Accuracy: 0.9667494893074036
Validation Loss: 1.3232100009918213
Validation Accuracy: 0.49800002574920654
Train Loss: 0.0967773050069809
Train Accuracy: 0.9692496657371521
Validation Loss: 1.3345681428909302
Validation Accuracy: 0.49799999594688416
Train Loss: 0.1077641174197197
Train Accuracy: 0.9667494297027588
Validation Loss: 1.3904973268508911
Validation Accuracy: 0.49600014090538025
Train Loss: 0.10736030340194702
Train Accuracy: 0.9674996137619019
Validation Loss: 1.3499650955200195
Validation Accuracy: 0.4859998822212219
Train Loss: 0.10902418196201324
Train Accuracy: 0.9657497406005859
Validation Loss: 1.3883949518203735
Validation Accuracy: 0.47800004482269287
Train Loss: 0.10207279026508331
Train Accuracy: 0.9679996371269226
Validation Loss: 1.446928858757019
Validation Accuracy: 0.4660000205039978
Train Loss: 0.10416492819786072
Train Accuracy: 0.9692496657371521
Validation Loss: 1.3282859325408936
Validation Accuracy: 0.4960000514984131
Train Loss: 0.09731706976890564
Train Accuracy: 0.9672496318817139
Validation Loss: 1.3528612852096558
Validation Accuracy: 0.48200005292892456
Train Loss: 0.07549325376749039
Train Accuracy: 0.9764997959136963
Validation Loss: 1.3729192018508911
Validation Accuracy: 0.5
Train Loss: 0.08194056153297424
Train Accuracy: 0.9762497544288635
Validation Loss: 1.3262829780578613
Validation Accuracy: 0.49999991059303284
Train Loss: 0.0918324664235115
Train Accuracy: 0.9699996709823608
Validation Loss: 1.3929874897003174
Validation Accuracy: 0.4760000705718994
Train Loss: 0.09855005145072937
Train Accuracy: 0.9694995284080505
==================
Resuming Training
=======5000=======
==================
0 / 1000 are evaluated.
50 / 1000 are evaluated.
100 / 1000 are evaluated.
150 / 1000 are evaluated.
200 / 1000 are evaluated.
250 / 1000 are evaluated.
300 / 1000 are evaluated.
350 / 1000 are evaluated.
400 / 1000 are evaluated.
450 / 1000 are evaluated.
500 / 1000 are evaluated.
550 / 1000 are evaluated.
600 / 1000 are evaluated.
650 / 1000 are evaluated.
700 / 1000 are evaluated.
750 / 1000 are evaluated.
800 / 1000 are evaluated.
850 / 1000 are evaluated.
900 / 1000 are evaluated.
950 / 1000 are evaluated.
loss mean: 1.17366361618042
loss std: 0.82892245054245
accuracy mean: 0.617400050163269
accuracy std: 0.2397858202457428
final acc: 0.617400050163269 +- 0.014862079114729958
final acc: 61.74 +- 1.49
