K= 5
N_WAY= 5
Model: "generator"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 512)]             0         
_________________________________________________________________
dense (Dense)                (None, 3136)              1608768   
_________________________________________________________________
leaky_re_lu (LeakyReLU)      (None, 3136)              0         
_________________________________________________________________
reshape (Reshape)            (None, 7, 7, 64)          0         
_________________________________________________________________
conv2d_transpose (Conv2DTran (None, 21, 21, 64)        65536     
_________________________________________________________________
batch_normalization (BatchNo (None, 21, 21, 64)        256       
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 21, 21, 64)        0         
_________________________________________________________________
conv2d_transpose_1 (Conv2DTr (None, 42, 42, 64)        65536     
_________________________________________________________________
batch_normalization_1 (Batch (None, 42, 42, 64)        256       
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 42, 42, 64)        0         
_________________________________________________________________
conv2d_transpose_2 (Conv2DTr (None, 84, 84, 64)        65536     
_________________________________________________________________
batch_normalization_2 (Batch (None, 84, 84, 64)        256       
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 84, 84, 64)        0         
_________________________________________________________________
conv2d_transpose_3 (Conv2DTr (None, 84, 84, 64)        65536     
_________________________________________________________________
batch_normalization_3 (Batch (None, 84, 84, 64)        256       
_________________________________________________________________
leaky_re_lu_4 (LeakyReLU)    (None, 84, 84, 64)        0         
_________________________________________________________________
conv2d_transpose_4 (Conv2DTr (None, 84, 84, 64)        65536     
_________________________________________________________________
batch_normalization_4 (Batch (None, 84, 84, 64)        256       
_________________________________________________________________
leaky_re_lu_5 (LeakyReLU)    (None, 84, 84, 64)        0         
_________________________________________________________________
conv2d (Conv2D)              (None, 84, 84, 3)         3075      
=================================================================
Total params: 1,940,803
Trainable params: 1,940,163
Non-trainable params: 640
_________________________________________________________________
Model: "discriminator"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_2 (InputLayer)         [(None, 84, 84, 3)]       0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 42, 42, 64)        3072      
_________________________________________________________________
batch_normalization_5 (Batch (None, 42, 42, 64)        256       
_________________________________________________________________
leaky_re_lu_6 (LeakyReLU)    (None, 42, 42, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 21, 21, 64)        65536     
_________________________________________________________________
batch_normalization_6 (Batch (None, 21, 21, 64)        256       
_________________________________________________________________
leaky_re_lu_7 (LeakyReLU)    (None, 21, 21, 64)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 11, 11, 64)        65536     
_________________________________________________________________
batch_normalization_7 (Batch (None, 11, 11, 64)        256       
_________________________________________________________________
leaky_re_lu_8 (LeakyReLU)    (None, 11, 11, 64)        0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 6, 6, 64)          65536     
_________________________________________________________________
batch_normalization_8 (Batch (None, 6, 6, 64)          256       
_________________________________________________________________
leaky_re_lu_9 (LeakyReLU)    (None, 6, 6, 64)          0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 3, 3, 64)          65536     
_________________________________________________________________
batch_normalization_9 (Batch (None, 3, 3, 64)          256       
_________________________________________________________________
leaky_re_lu_10 (LeakyReLU)   (None, 3, 3, 64)          0         
_________________________________________________________________
global_max_pooling2d (Global (None, 64)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 65        
=================================================================
Total params: 266,561
Trainable params: 265,921
Non-trainable params: 640
_________________________________________________________________
Continue training from epoch 100.
training GAN is done
Model: "MiniImagenetModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
max_pooling2d (MaxPooling2D) multiple                  0         
_________________________________________________________________
conv1 (Conv2D)               multiple                  896       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv2 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv3 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv4 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  96        
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  1445      
=================================================================
Total params: 30,469
Trainable params: 30,213
Non-trainable params: 256
_________________________________________________________________
Model: "MiniImagenetModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
max_pooling2d_1 (MaxPooling2 multiple                  0         
_________________________________________________________________
conv1 (Conv2D)               multiple                  896       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv2 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv3 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv4 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  96        
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  1445      
=================================================================
Total params: 30,469
Trainable params: 30,213
Non-trainable params: 256
_________________________________________________________________
Model: "MiniImagenetModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
max_pooling2d_2 (MaxPooling2 multiple                  0         
_________________________________________________________________
conv1 (Conv2D)               multiple                  896       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv2 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv3 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv4 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  96        
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  1445      
=================================================================
Total params: 30,469
Trainable params: 30,213
Non-trainable params: 256
_________________________________________________________________
Model: "MiniImagenetModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
max_pooling2d_3 (MaxPooling2 multiple                  0         
_________________________________________________________________
conv1 (Conv2D)               multiple                  896       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv2 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv3 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv4 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  96        
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  1445      
=================================================================
Total params: 30,469
Trainable params: 30,213
Non-trainable params: 256
_________________________________________________________________
Model: "MiniImagenetModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
max_pooling2d_4 (MaxPooling2 multiple                  0         
_________________________________________________________________
conv1 (Conv2D)               multiple                  896       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv2 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv3 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv4 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  96        
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  1445      
=================================================================
Total params: 30,469
Trainable params: 30,213
Non-trainable params: 256
_________________________________________________________________
Model: "MiniImagenetModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
max_pooling2d_5 (MaxPooling2 multiple                  0         
_________________________________________________________________
conv1 (Conv2D)               multiple                  896       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv2 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv3 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv4 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  96        
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  1445      
=================================================================
Total params: 30,469
Trainable params: 30,213
Non-trainable params: 256
_________________________________________________________________
Model: "MiniImagenetModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
max_pooling2d_6 (MaxPooling2 multiple                  0         
_________________________________________________________________
conv1 (Conv2D)               multiple                  896       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv2 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv3 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv4 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  96        
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  1445      
=================================================================
Total params: 30,469
Trainable params: 30,213
Non-trainable params: 256
_________________________________________________________________
Model: "MiniImagenetModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
max_pooling2d_7 (MaxPooling2 multiple                  0         
_________________________________________________________________
conv1 (Conv2D)               multiple                  896       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv2 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv3 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv4 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  96        
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  1445      
=================================================================
Total params: 30,469
Trainable params: 30,213
Non-trainable params: 256
_________________________________________________________________
Model: "MiniImagenetModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
max_pooling2d_8 (MaxPooling2 multiple                  0         
_________________________________________________________________
conv1 (Conv2D)               multiple                  896       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv2 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv3 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv4 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  96        
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  1445      
=================================================================
Total params: 30,469
Trainable params: 30,213
Non-trainable params: 256
_________________________________________________________________
Model: "MiniImagenetModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
max_pooling2d_9 (MaxPooling2 multiple                  0         
_________________________________________________________________
conv1 (Conv2D)               multiple                  896       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv2 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv3 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv4 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  96        
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  1445      
=================================================================
Total params: 30,469
Trainable params: 30,213
Non-trainable params: 256
_________________________________________________________________
Model: "MiniImagenetModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
max_pooling2d_10 (MaxPooling multiple                  0         
_________________________________________________________________
conv1 (Conv2D)               multiple                  896       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv2 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv3 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv4 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  96        
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  1445      
=================================================================
Total params: 30,469
Trainable params: 30,213
Non-trainable params: 256
_________________________________________________________________
Model: "MiniImagenetModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
max_pooling2d_11 (MaxPooling multiple                  0         
_________________________________________________________________
conv1 (Conv2D)               multiple                  896       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv2 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv3 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv4 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  96        
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  1445      
=================================================================
Total params: 30,469
Trainable params: 30,213
Non-trainable params: 256
_________________________________________________________________
Model: "MiniImagenetModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
max_pooling2d_12 (MaxPooling multiple                  0         
_________________________________________________________________
conv1 (Conv2D)               multiple                  896       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv2 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv3 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv4 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  96        
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  1445      
=================================================================
Total params: 30,469
Trainable params: 30,213
Non-trainable params: 256
_________________________________________________________________
Model: "MiniImagenetModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
max_pooling2d_13 (MaxPooling multiple                  0         
_________________________________________________________________
conv1 (Conv2D)               multiple                  896       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv2 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv3 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv4 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  96        
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  1445      
=================================================================
Total params: 30,469
Trainable params: 30,213
Non-trainable params: 256
_________________________________________________________________
Model: "MiniImagenetModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
max_pooling2d_14 (MaxPooling multiple                  0         
_________________________________________________________________
conv1 (Conv2D)               multiple                  896       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv2 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv3 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv4 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  96        
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  1445      
=================================================================
Total params: 30,469
Trainable params: 30,213
Non-trainable params: 256
_________________________________________________________________
Model: "MiniImagenetModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
max_pooling2d_15 (MaxPooling multiple                  0         
_________________________________________________________________
conv1 (Conv2D)               multiple                  896       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv2 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv3 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv4 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  96        
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  1445      
=================================================================
Total params: 30,469
Trainable params: 30,213
Non-trainable params: 256
_________________________________________________________________
Not Loading any SLMAMLGAN model
 #### ### ## # N_labeled: 20
 #### ### ## # N_gen 0
Percentage of labeled data: 0.2
Validation Loss: 1.7767044305801392
Validation Accuracy: 0.3132000267505646
Validation Loss: 1.7137746810913086
Validation Accuracy: 0.324800044298172
Train Loss: 1.616628885269165
Train Accuracy: 0.3386000692844391
Validation Loss: 1.681954026222229
Validation Accuracy: 0.33480003476142883
Train Loss: 1.478157639503479
Train Accuracy: 0.37240004539489746
Validation Loss: 1.6339175701141357
Validation Accuracy: 0.341200053691864
Train Loss: 1.4212312698364258
Train Accuracy: 0.3970000147819519
Validation Loss: 1.626089334487915
Validation Accuracy: 0.33200007677078247
Train Loss: 1.3688102960586548
Train Accuracy: 0.430400013923645
Validation Loss: 1.6958781480789185
Validation Accuracy: 0.3372000455856323
Train Loss: 1.3376648426055908
Train Accuracy: 0.43380025029182434
Validation Loss: 1.633454442024231
Validation Accuracy: 0.33240002393722534
Train Loss: 1.3125284910202026
Train Accuracy: 0.4524000287055969
Validation Loss: 1.6205427646636963
Validation Accuracy: 0.3499999940395355
Train Loss: 1.310564398765564
Train Accuracy: 0.45860013365745544
Validation Loss: 1.5484793186187744
Validation Accuracy: 0.36200010776519775
Train Loss: 1.2601736783981323
Train Accuracy: 0.4814000725746155
Validation Loss: 1.5833653211593628
Validation Accuracy: 0.3575999438762665
Train Loss: 1.256016492843628
Train Accuracy: 0.47420021891593933
Validation Loss: 1.5847586393356323
Validation Accuracy: 0.34919995069503784
Train Loss: 1.2511725425720215
Train Accuracy: 0.48159992694854736
Validation Loss: 1.4947277307510376
Validation Accuracy: 0.3784000873565674
Train Loss: 1.2239222526550293
Train Accuracy: 0.5060001611709595
Validation Loss: 1.469459891319275
Validation Accuracy: 0.38839998841285706
Train Loss: 1.2214932441711426
Train Accuracy: 0.5067999362945557
Validation Loss: 1.5414623022079468
Validation Accuracy: 0.37679994106292725
Train Loss: 1.197748064994812
Train Accuracy: 0.5103998780250549
Validation Loss: 1.486913800239563
Validation Accuracy: 0.37720000743865967
Train Loss: 1.1850638389587402
Train Accuracy: 0.5195999145507812
Validation Loss: 1.4672012329101562
Validation Accuracy: 0.39280006289482117
Train Loss: 1.1763701438903809
Train Accuracy: 0.5338000655174255
Validation Loss: 1.5068858861923218
Validation Accuracy: 0.37320011854171753
Train Loss: 1.1517542600631714
Train Accuracy: 0.5469998121261597
Validation Loss: 1.4830868244171143
Validation Accuracy: 0.3911999464035034
Train Loss: 1.1383945941925049
Train Accuracy: 0.5586000084877014
Validation Loss: 1.4633549451828003
Validation Accuracy: 0.4103999733924866
Train Loss: 1.1362602710723877
Train Accuracy: 0.5487998723983765
Validation Loss: 1.447036623954773
Validation Accuracy: 0.4124000072479248
Train Loss: 1.1064517498016357
Train Accuracy: 0.5627998113632202
Validation Loss: 1.4285446405410767
Validation Accuracy: 0.414000004529953
Train Loss: 1.1031982898712158
Train Accuracy: 0.5682001113891602
Validation Loss: 1.437381386756897
Validation Accuracy: 0.4131999611854553
Train Loss: 1.1160593032836914
Train Accuracy: 0.5613998770713806
Validation Loss: 1.460295557975769
Validation Accuracy: 0.39320001006126404
Train Loss: 1.095290184020996
Train Accuracy: 0.5707998275756836
Validation Loss: 1.422519326210022
Validation Accuracy: 0.4108000099658966
Train Loss: 1.0709540843963623
Train Accuracy: 0.5779999494552612
Validation Loss: 1.451625943183899
Validation Accuracy: 0.40240010619163513
Train Loss: 1.0672379732131958
Train Accuracy: 0.577799916267395
Validation Loss: 1.4096063375473022
Validation Accuracy: 0.42239993810653687
Train Loss: 1.0627745389938354
Train Accuracy: 0.5885998010635376
Validation Loss: 1.3866442441940308
Validation Accuracy: 0.43880000710487366
Train Loss: 1.061479091644287
Train Accuracy: 0.5873998999595642
Validation Loss: 1.4031689167022705
Validation Accuracy: 0.4203999638557434
Train Loss: 1.0846893787384033
Train Accuracy: 0.5750000476837158
Validation Loss: 1.4035513401031494
Validation Accuracy: 0.41960006952285767
Train Loss: 1.0124274492263794
Train Accuracy: 0.6167998909950256
Validation Loss: 1.4049938917160034
Validation Accuracy: 0.4184000790119171
Train Loss: 1.0327264070510864
Train Accuracy: 0.6125999689102173
Validation Loss: 1.4063316583633423
Validation Accuracy: 0.4196000397205353
Train Loss: 1.0055267810821533
Train Accuracy: 0.6149998307228088
Validation Loss: 1.376236081123352
Validation Accuracy: 0.44080010056495667
Train Loss: 1.0231621265411377
Train Accuracy: 0.6107999682426453
Validation Loss: 1.428343653678894
Validation Accuracy: 0.4044000208377838
Train Loss: 1.0033791065216064
Train Accuracy: 0.612799882888794
Validation Loss: 1.4154725074768066
Validation Accuracy: 0.41999998688697815
Train Loss: 0.992677628993988
Train Accuracy: 0.6177999973297119
Validation Loss: 1.3936270475387573
Validation Accuracy: 0.4252000153064728
Train Loss: 0.9683976173400879
Train Accuracy: 0.6329998970031738
Validation Loss: 1.419262409210205
Validation Accuracy: 0.4227999448776245
Train Loss: 0.976780116558075
Train Accuracy: 0.6355999708175659
Validation Loss: 1.4240272045135498
Validation Accuracy: 0.408799946308136
Train Loss: 0.9726075530052185
Train Accuracy: 0.6215996742248535
Validation Loss: 1.4006773233413696
Validation Accuracy: 0.42040008306503296
Train Loss: 0.9814877510070801
Train Accuracy: 0.6256000399589539
Validation Loss: 1.3966269493103027
Validation Accuracy: 0.425199955701828
Train Loss: 0.9470826983451843
Train Accuracy: 0.6505998373031616
Validation Loss: 1.4236160516738892
Validation Accuracy: 0.4127999246120453
Train Loss: 0.9493040442466736
Train Accuracy: 0.6499997973442078
Validation Loss: 1.4262088537216187
Validation Accuracy: 0.41560009121894836
Train Loss: 0.9650084972381592
Train Accuracy: 0.6505998969078064
Validation Loss: 1.4067802429199219
Validation Accuracy: 0.42600005865097046
Train Loss: 0.9427942037582397
Train Accuracy: 0.6516000628471375
Validation Loss: 1.4038395881652832
Validation Accuracy: 0.42760002613067627
Train Loss: 0.922888994216919
Train Accuracy: 0.6701998114585876
Validation Loss: 1.3942183256149292
Validation Accuracy: 0.4255998730659485
Train Loss: 0.9333088397979736
Train Accuracy: 0.6613999009132385
Validation Loss: 1.3903343677520752
Validation Accuracy: 0.4288000464439392
Train Loss: 0.911472499370575
Train Accuracy: 0.6619998812675476
Validation Loss: 1.4353554248809814
Validation Accuracy: 0.40639999508857727
Train Loss: 0.9106060266494751
Train Accuracy: 0.6727997660636902
Validation Loss: 1.4282335042953491
Validation Accuracy: 0.4112001061439514
Train Loss: 0.9039829969406128
Train Accuracy: 0.6770000457763672
Validation Loss: 1.4039692878723145
Validation Accuracy: 0.4195999801158905
Train Loss: 0.9006363153457642
Train Accuracy: 0.6702000498771667
Validation Loss: 1.4511520862579346
Validation Accuracy: 0.4027998745441437
Train Loss: 0.88641756772995
Train Accuracy: 0.6757999658584595
Validation Loss: 1.4038974046707153
Validation Accuracy: 0.4160000681877136
Train Loss: 0.9044075012207031
Train Accuracy: 0.660399854183197
Validation Loss: 1.4723756313323975
Validation Accuracy: 0.40039998292922974
Train Loss: 0.8929721713066101
Train Accuracy: 0.6665998101234436
Validation Loss: 1.4142663478851318
Validation Accuracy: 0.4155999422073364
Train Loss: 0.8923998475074768
Train Accuracy: 0.6717998385429382
Validation Loss: 1.4236416816711426
Validation Accuracy: 0.4184000790119171
Train Loss: 0.9086196422576904
Train Accuracy: 0.6583998203277588
Validation Loss: 1.4337408542633057
Validation Accuracy: 0.42200005054473877
Train Loss: 0.8727883100509644
Train Accuracy: 0.6693997383117676
Validation Loss: 1.4198570251464844
Validation Accuracy: 0.4160001277923584
Train Loss: 0.850435733795166
Train Accuracy: 0.6915999054908752
Validation Loss: 1.4320355653762817
Validation Accuracy: 0.40119999647140503
Train Loss: 0.8596226572990417
Train Accuracy: 0.681399941444397
Validation Loss: 1.4128215312957764
Validation Accuracy: 0.4196000397205353
Train Loss: 0.8425390124320984
Train Accuracy: 0.6981996297836304
Validation Loss: 1.439001441001892
Validation Accuracy: 0.4219999611377716
Train Loss: 0.8367977738380432
Train Accuracy: 0.6895999312400818
Validation Loss: 1.4004572629928589
Validation Accuracy: 0.4299999475479126
Train Loss: 0.8410756587982178
Train Accuracy: 0.6870000958442688
Validation Loss: 1.487381100654602
Validation Accuracy: 0.3996000289916992
Train Loss: 0.8237699866294861
Train Accuracy: 0.7016001343727112
Validation Loss: 1.4299683570861816
Validation Accuracy: 0.41400009393692017
Train Loss: 0.8407160043716431
Train Accuracy: 0.691199779510498
Validation Loss: 1.4416786432266235
Validation Accuracy: 0.41759994626045227
Train Loss: 0.8128415942192078
Train Accuracy: 0.707399845123291
Validation Loss: 1.4322335720062256
Validation Accuracy: 0.4143999516963959
Train Loss: 0.8407737016677856
Train Accuracy: 0.6959999799728394
Validation Loss: 1.4442567825317383
Validation Accuracy: 0.41119998693466187
Train Loss: 0.8436176180839539
Train Accuracy: 0.6759999990463257
Validation Loss: 1.4419760704040527
Validation Accuracy: 0.4200000464916229
Train Loss: 0.8044890761375427
Train Accuracy: 0.7071998715400696
Validation Loss: 1.438001275062561
Validation Accuracy: 0.4228000342845917
Train Loss: 0.7916597127914429
Train Accuracy: 0.7121996879577637
Validation Loss: 1.4451820850372314
Validation Accuracy: 0.4088000953197479
Train Loss: 0.8278378844261169
Train Accuracy: 0.6991998553276062
Validation Loss: 1.4539976119995117
Validation Accuracy: 0.4132000207901001
Train Loss: 0.7715431451797485
Train Accuracy: 0.7227998375892639
Validation Loss: 1.502152681350708
Validation Accuracy: 0.3932000398635864
Train Loss: 0.7886127233505249
Train Accuracy: 0.7153998613357544
Validation Loss: 1.4500864744186401
Validation Accuracy: 0.40160006284713745
Train Loss: 0.7901875376701355
Train Accuracy: 0.7139998078346252
Validation Loss: 1.4068975448608398
Validation Accuracy: 0.42760005593299866
Train Loss: 0.7680206894874573
Train Accuracy: 0.7203998565673828
Validation Loss: 1.4164618253707886
Validation Accuracy: 0.41359996795654297
Train Loss: 0.7856734991073608
Train Accuracy: 0.7155998349189758
Validation Loss: 1.4401925802230835
Validation Accuracy: 0.4203999638557434
Train Loss: 0.7876834869384766
Train Accuracy: 0.7183994054794312
Validation Loss: 1.4628790616989136
Validation Accuracy: 0.40400001406669617
Train Loss: 0.7826560139656067
Train Accuracy: 0.7173995971679688
Validation Loss: 1.4248124361038208
Validation Accuracy: 0.41359996795654297
Train Loss: 0.7722559571266174
Train Accuracy: 0.7253998517990112
Validation Loss: 1.4386639595031738
Validation Accuracy: 0.41519999504089355
Train Loss: 0.753323495388031
Train Accuracy: 0.7349998950958252
==================
Resuming Training
=======15000=======
==================
0 / 100 are evaluated.
5 / 100 are evaluated.
10 / 100 are evaluated.
15 / 100 are evaluated.
20 / 100 are evaluated.
25 / 100 are evaluated.
30 / 100 are evaluated.
35 / 100 are evaluated.
40 / 100 are evaluated.
45 / 100 are evaluated.
50 / 100 are evaluated.
55 / 100 are evaluated.
60 / 100 are evaluated.
65 / 100 are evaluated.
70 / 100 are evaluated.
75 / 100 are evaluated.
80 / 100 are evaluated.
85 / 100 are evaluated.
90 / 100 are evaluated.
95 / 100 are evaluated.
loss mean: 1.4000033140182495
loss std: 0.3530113101005554
accuracy mean: 0.49880000948905945
accuracy std: 0.11681848764419556
final acc: 0.49880000948905945 +- 0.02289642357826233
final acc: 49.88 +- 2.29
