K= 5
N_WAY= 5
Model: "generator"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 512)]             0         
_________________________________________________________________
dense (Dense)                (None, 3136)              1608768   
_________________________________________________________________
leaky_re_lu (LeakyReLU)      (None, 3136)              0         
_________________________________________________________________
reshape (Reshape)            (None, 7, 7, 64)          0         
_________________________________________________________________
conv2d_transpose (Conv2DTran (None, 21, 21, 64)        65536     
_________________________________________________________________
batch_normalization (BatchNo (None, 21, 21, 64)        256       
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 21, 21, 64)        0         
_________________________________________________________________
conv2d_transpose_1 (Conv2DTr (None, 42, 42, 64)        65536     
_________________________________________________________________
batch_normalization_1 (Batch (None, 42, 42, 64)        256       
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 42, 42, 64)        0         
_________________________________________________________________
conv2d_transpose_2 (Conv2DTr (None, 84, 84, 64)        65536     
_________________________________________________________________
batch_normalization_2 (Batch (None, 84, 84, 64)        256       
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 84, 84, 64)        0         
_________________________________________________________________
conv2d_transpose_3 (Conv2DTr (None, 84, 84, 64)        65536     
_________________________________________________________________
batch_normalization_3 (Batch (None, 84, 84, 64)        256       
_________________________________________________________________
leaky_re_lu_4 (LeakyReLU)    (None, 84, 84, 64)        0         
_________________________________________________________________
conv2d_transpose_4 (Conv2DTr (None, 84, 84, 64)        65536     
_________________________________________________________________
batch_normalization_4 (Batch (None, 84, 84, 64)        256       
_________________________________________________________________
leaky_re_lu_5 (LeakyReLU)    (None, 84, 84, 64)        0         
_________________________________________________________________
conv2d (Conv2D)              (None, 84, 84, 3)         3075      
=================================================================
Total params: 1,940,803
Trainable params: 1,940,163
Non-trainable params: 640
_________________________________________________________________
Model: "discriminator"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_2 (InputLayer)         [(None, 84, 84, 3)]       0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 42, 42, 64)        3072      
_________________________________________________________________
batch_normalization_5 (Batch (None, 42, 42, 64)        256       
_________________________________________________________________
leaky_re_lu_6 (LeakyReLU)    (None, 42, 42, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 21, 21, 64)        65536     
_________________________________________________________________
batch_normalization_6 (Batch (None, 21, 21, 64)        256       
_________________________________________________________________
leaky_re_lu_7 (LeakyReLU)    (None, 21, 21, 64)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 11, 11, 64)        65536     
_________________________________________________________________
batch_normalization_7 (Batch (None, 11, 11, 64)        256       
_________________________________________________________________
leaky_re_lu_8 (LeakyReLU)    (None, 11, 11, 64)        0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 6, 6, 64)          65536     
_________________________________________________________________
batch_normalization_8 (Batch (None, 6, 6, 64)          256       
_________________________________________________________________
leaky_re_lu_9 (LeakyReLU)    (None, 6, 6, 64)          0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 3, 3, 64)          65536     
_________________________________________________________________
batch_normalization_9 (Batch (None, 3, 3, 64)          256       
_________________________________________________________________
leaky_re_lu_10 (LeakyReLU)   (None, 3, 3, 64)          0         
_________________________________________________________________
global_max_pooling2d (Global (None, 64)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 65        
=================================================================
Total params: 266,561
Trainable params: 265,921
Non-trainable params: 640
_________________________________________________________________
Continue training from epoch 100.
training GAN is done
Model: "MiniImagenetModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
max_pooling2d (MaxPooling2D) multiple                  0         
_________________________________________________________________
conv1 (Conv2D)               multiple                  896       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv2 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv3 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv4 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  96        
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  1445      
=================================================================
Total params: 30,469
Trainable params: 30,213
Non-trainable params: 256
_________________________________________________________________
Model: "MiniImagenetModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
max_pooling2d_1 (MaxPooling2 multiple                  0         
_________________________________________________________________
conv1 (Conv2D)               multiple                  896       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv2 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv3 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv4 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  96        
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  1445      
=================================================================
Total params: 30,469
Trainable params: 30,213
Non-trainable params: 256
_________________________________________________________________
Model: "MiniImagenetModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
max_pooling2d_2 (MaxPooling2 multiple                  0         
_________________________________________________________________
conv1 (Conv2D)               multiple                  896       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv2 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv3 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv4 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  96        
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  1445      
=================================================================
Total params: 30,469
Trainable params: 30,213
Non-trainable params: 256
_________________________________________________________________
Model: "MiniImagenetModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
max_pooling2d_3 (MaxPooling2 multiple                  0         
_________________________________________________________________
conv1 (Conv2D)               multiple                  896       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv2 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv3 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv4 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  96        
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  1445      
=================================================================
Total params: 30,469
Trainable params: 30,213
Non-trainable params: 256
_________________________________________________________________
Model: "MiniImagenetModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
max_pooling2d_4 (MaxPooling2 multiple                  0         
_________________________________________________________________
conv1 (Conv2D)               multiple                  896       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv2 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv3 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv4 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  96        
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  1445      
=================================================================
Total params: 30,469
Trainable params: 30,213
Non-trainable params: 256
_________________________________________________________________
Model: "MiniImagenetModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
max_pooling2d_5 (MaxPooling2 multiple                  0         
_________________________________________________________________
conv1 (Conv2D)               multiple                  896       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv2 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv3 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv4 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  96        
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  1445      
=================================================================
Total params: 30,469
Trainable params: 30,213
Non-trainable params: 256
_________________________________________________________________
Model: "MiniImagenetModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
max_pooling2d_6 (MaxPooling2 multiple                  0         
_________________________________________________________________
conv1 (Conv2D)               multiple                  896       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv2 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv3 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv4 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  96        
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  1445      
=================================================================
Total params: 30,469
Trainable params: 30,213
Non-trainable params: 256
_________________________________________________________________
Model: "MiniImagenetModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
max_pooling2d_7 (MaxPooling2 multiple                  0         
_________________________________________________________________
conv1 (Conv2D)               multiple                  896       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv2 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv3 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv4 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  96        
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  1445      
=================================================================
Total params: 30,469
Trainable params: 30,213
Non-trainable params: 256
_________________________________________________________________
Model: "MiniImagenetModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
max_pooling2d_8 (MaxPooling2 multiple                  0         
_________________________________________________________________
conv1 (Conv2D)               multiple                  896       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv2 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv3 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv4 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  96        
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  1445      
=================================================================
Total params: 30,469
Trainable params: 30,213
Non-trainable params: 256
_________________________________________________________________
Model: "MiniImagenetModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
max_pooling2d_9 (MaxPooling2 multiple                  0         
_________________________________________________________________
conv1 (Conv2D)               multiple                  896       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv2 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv3 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv4 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  96        
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  1445      
=================================================================
Total params: 30,469
Trainable params: 30,213
Non-trainable params: 256
_________________________________________________________________
Model: "MiniImagenetModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
max_pooling2d_10 (MaxPooling multiple                  0         
_________________________________________________________________
conv1 (Conv2D)               multiple                  896       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv2 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv3 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv4 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  96        
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  1445      
=================================================================
Total params: 30,469
Trainable params: 30,213
Non-trainable params: 256
_________________________________________________________________
Model: "MiniImagenetModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
max_pooling2d_11 (MaxPooling multiple                  0         
_________________________________________________________________
conv1 (Conv2D)               multiple                  896       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv2 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv3 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv4 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  96        
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  1445      
=================================================================
Total params: 30,469
Trainable params: 30,213
Non-trainable params: 256
_________________________________________________________________
Model: "MiniImagenetModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
max_pooling2d_12 (MaxPooling multiple                  0         
_________________________________________________________________
conv1 (Conv2D)               multiple                  896       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv2 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv3 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv4 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  96        
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  1445      
=================================================================
Total params: 30,469
Trainable params: 30,213
Non-trainable params: 256
_________________________________________________________________
Model: "MiniImagenetModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
max_pooling2d_13 (MaxPooling multiple                  0         
_________________________________________________________________
conv1 (Conv2D)               multiple                  896       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv2 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv3 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv4 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  96        
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  1445      
=================================================================
Total params: 30,469
Trainable params: 30,213
Non-trainable params: 256
_________________________________________________________________
Model: "MiniImagenetModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
max_pooling2d_14 (MaxPooling multiple                  0         
_________________________________________________________________
conv1 (Conv2D)               multiple                  896       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv2 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv3 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv4 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  96        
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  1445      
=================================================================
Total params: 30,469
Trainable params: 30,213
Non-trainable params: 256
_________________________________________________________________
Model: "MiniImagenetModel"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
max_pooling2d_15 (MaxPooling multiple                  0         
_________________________________________________________________
conv1 (Conv2D)               multiple                  896       
_________________________________________________________________
bn1 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv2 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn2 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv3 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn3 (BatchNormalization)     multiple                  96        
_________________________________________________________________
conv4 (Conv2D)               multiple                  9248      
_________________________________________________________________
bn4 (BatchNormalization)     multiple                  96        
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  1445      
=================================================================
Total params: 30,469
Trainable params: 30,213
Non-trainable params: 256
_________________________________________________________________
Not Loading any SSMLMAMLGAN model
==================
Resuming Training
=======5000=======
==================
 #### ### ## # N_labeled: 2
 #### ### ## # N_gen 18
Percentage of labeled data: 0.1
Validation Loss: 1.8751314878463745
Validation Accuracy: 0.3287999629974365
Train Loss: 0.3672286868095398
Train Accuracy: 0.8864001631736755
Validation Loss: 1.746159315109253
Validation Accuracy: 0.34160006046295166
Train Loss: 0.3313007652759552
Train Accuracy: 0.8972002267837524
Validation Loss: 1.7625678777694702
Validation Accuracy: 0.33560001850128174
Train Loss: 0.30262577533721924
Train Accuracy: 0.9080002307891846
Validation Loss: 1.858918309211731
Validation Accuracy: 0.31800004839897156
Train Loss: 0.34576094150543213
Train Accuracy: 0.8880001902580261
Validation Loss: 1.9121687412261963
Validation Accuracy: 0.31679999828338623
Train Loss: 0.3815305829048157
Train Accuracy: 0.8714000582695007
Validation Loss: 1.8144193887710571
Validation Accuracy: 0.322000116109848
Train Loss: 0.3635731637477875
Train Accuracy: 0.8812001943588257
Validation Loss: 1.836251974105835
Validation Accuracy: 0.32920002937316895
Train Loss: 0.42089569568634033
Train Accuracy: 0.8691999316215515
Validation Loss: 1.788912057876587
Validation Accuracy: 0.3347999155521393
Train Loss: 0.3593028783798218
Train Accuracy: 0.8822000026702881
Validation Loss: 1.8544654846191406
Validation Accuracy: 0.3128000795841217
Train Loss: 0.33154746890068054
Train Accuracy: 0.8886001110076904
Validation Loss: 1.8418090343475342
Validation Accuracy: 0.3188000023365021
Train Loss: 0.32963287830352783
Train Accuracy: 0.8969999551773071
Validation Loss: 1.7976391315460205
Validation Accuracy: 0.3304000198841095
Train Loss: 0.311771422624588
Train Accuracy: 0.90220046043396
Validation Loss: 1.7846519947052002
Validation Accuracy: 0.31640002131462097
Train Loss: 0.2923049032688141
Train Accuracy: 0.9062004089355469
Validation Loss: 1.891128659248352
Validation Accuracy: 0.32280004024505615
Train Loss: 0.28257033228874207
Train Accuracy: 0.910200297832489
Validation Loss: 1.8158351182937622
Validation Accuracy: 0.3256000280380249
Train Loss: 0.29602378606796265
Train Accuracy: 0.9070003628730774
Validation Loss: 1.7843043804168701
Validation Accuracy: 0.33319994807243347
Train Loss: 0.2606163024902344
Train Accuracy: 0.9189999103546143
Validation Loss: 1.7636865377426147
Validation Accuracy: 0.32760006189346313
Train Loss: 0.2543828785419464
Train Accuracy: 0.9178004264831543
Validation Loss: 1.7597583532333374
Validation Accuracy: 0.3271999657154083
Train Loss: 0.2642265260219574
Train Accuracy: 0.9164003133773804
Validation Loss: 1.7701845169067383
Validation Accuracy: 0.32840004563331604
Train Loss: 0.2572895288467407
Train Accuracy: 0.9126001596450806
Validation Loss: 1.7815769910812378
Validation Accuracy: 0.3376000225543976
Train Loss: 0.24693357944488525
Train Accuracy: 0.9188002943992615
Validation Loss: 1.8259608745574951
Validation Accuracy: 0.3248000741004944
Train Loss: 0.2507339417934418
Train Accuracy: 0.9136003851890564
Validation Loss: 1.7834961414337158
Validation Accuracy: 0.3344000279903412
Train Loss: 0.25008851289749146
Train Accuracy: 0.9224002361297607
Validation Loss: 1.8010631799697876
Validation Accuracy: 0.33800002932548523
Train Loss: 0.24699096381664276
Train Accuracy: 0.9222003221511841
Validation Loss: 1.8072620630264282
Validation Accuracy: 0.33319994807243347
Train Loss: 0.2405605912208557
Train Accuracy: 0.9246004223823547
Validation Loss: 1.8389637470245361
Validation Accuracy: 0.3296000361442566
Train Loss: 0.22725044190883636
Train Accuracy: 0.9270004034042358
Validation Loss: 1.867491602897644
Validation Accuracy: 0.3215999901294708
Train Loss: 0.2934953570365906
Train Accuracy: 0.9030004143714905
Validation Loss: 1.840875267982483
Validation Accuracy: 0.3200000524520874
Train Loss: 0.26356735825538635
Train Accuracy: 0.9136001467704773
Validation Loss: 1.8622736930847168
Validation Accuracy: 0.3123999834060669
Train Loss: 0.2534230053424835
Train Accuracy: 0.9210002422332764
Validation Loss: 1.8205358982086182
Validation Accuracy: 0.3360000252723694
Train Loss: 0.25616011023521423
Train Accuracy: 0.9196001291275024
Validation Loss: 1.8167097568511963
Validation Accuracy: 0.33239996433258057
Train Loss: 0.23134547472000122
Train Accuracy: 0.9274001121520996
Validation Loss: 1.8859754800796509
Validation Accuracy: 0.3199999928474426
Train Loss: 0.2708267271518707
Train Accuracy: 0.9106003046035767
Validation Loss: 1.9759210348129272
Validation Accuracy: 0.30959999561309814
Train Loss: 0.2540648579597473
Train Accuracy: 0.9178003072738647
Validation Loss: 1.9534777402877808
Validation Accuracy: 0.33160001039505005
Train Loss: 0.36784571409225464
Train Accuracy: 0.8723998069763184
Validation Loss: 1.8199633359909058
Validation Accuracy: 0.3372001647949219
Train Loss: 0.36001983284950256
Train Accuracy: 0.8834003210067749
Validation Loss: 1.7783862352371216
Validation Accuracy: 0.32920002937316895
Train Loss: 0.2958187162876129
Train Accuracy: 0.9024001955986023
Validation Loss: 1.9546818733215332
Validation Accuracy: 0.31400004029273987
Train Loss: 0.3744024932384491
Train Accuracy: 0.8827999830245972
Validation Loss: 1.9447875022888184
Validation Accuracy: 0.3083999752998352
Train Loss: 0.3203316926956177
Train Accuracy: 0.9012004137039185
Validation Loss: 1.9132142066955566
Validation Accuracy: 0.3116000294685364
Train Loss: 0.2752552330493927
Train Accuracy: 0.9126003980636597
Validation Loss: 1.8909308910369873
Validation Accuracy: 0.30319997668266296
Train Loss: 0.2691076099872589
Train Accuracy: 0.9160003662109375
Validation Loss: 1.8826178312301636
Validation Accuracy: 0.30720004439353943
Train Loss: 0.2571733593940735
Train Accuracy: 0.9186002612113953
Validation Loss: 1.8881229162216187
Validation Accuracy: 0.3100000321865082
Train Loss: 0.2639663815498352
Train Accuracy: 0.9192003011703491
Validation Loss: 2.092890977859497
Validation Accuracy: 0.2979999780654907
Train Loss: 0.2807120084762573
Train Accuracy: 0.9166002869606018
Validation Loss: 1.920915961265564
Validation Accuracy: 0.31880006194114685
Train Loss: 0.29346102476119995
Train Accuracy: 0.9074004292488098
Validation Loss: 1.9119430780410767
Validation Accuracy: 0.3304000794887543
Train Loss: 0.25028833746910095
Train Accuracy: 0.9196003675460815
Validation Loss: 1.8860684633255005
Validation Accuracy: 0.3240000009536743
Train Loss: 0.23208977282047272
Train Accuracy: 0.9238004088401794
Validation Loss: 1.8762472867965698
Validation Accuracy: 0.3168000280857086
Train Loss: 0.22841154038906097
Train Accuracy: 0.9246002435684204
Validation Loss: 1.8160009384155273
Validation Accuracy: 0.32920002937316895
Train Loss: 0.24670633673667908
Train Accuracy: 0.9226006269454956
Validation Loss: 1.857967495918274
Validation Accuracy: 0.33000001311302185
Train Loss: 0.2462020069360733
Train Accuracy: 0.9220001101493835
Validation Loss: 1.7946721315383911
Validation Accuracy: 0.3264000415802002
Train Loss: 0.24146176874637604
Train Accuracy: 0.922800600528717
Validation Loss: 1.8666157722473145
Validation Accuracy: 0.32239994406700134
Train Loss: 0.226020947098732
Train Accuracy: 0.9258001446723938
Validation Loss: 1.8754026889801025
Validation Accuracy: 0.31679999828338623
Train Loss: 0.22977720201015472
Train Accuracy: 0.9196003079414368
==================
Resuming Training
=======15000=======
==================
0 / 100 are evaluated.
5 / 100 are evaluated.
10 / 100 are evaluated.
15 / 100 are evaluated.
20 / 100 are evaluated.
25 / 100 are evaluated.
30 / 100 are evaluated.
35 / 100 are evaluated.
40 / 100 are evaluated.
45 / 100 are evaluated.
50 / 100 are evaluated.
55 / 100 are evaluated.
60 / 100 are evaluated.
65 / 100 are evaluated.
70 / 100 are evaluated.
75 / 100 are evaluated.
80 / 100 are evaluated.
85 / 100 are evaluated.
90 / 100 are evaluated.
95 / 100 are evaluated.
loss mean: 2.088120460510254
loss std: 0.3887077271938324
accuracy mean: 0.32759997248649597
accuracy std: 0.10082777589559555
final acc: 0.32759997248649597 +- 0.019762244075536728
final acc: 32.76 +- 1.98
